1. What is the difference between a Series and a Dataframe.
- Series is 1-Dimensional array that can hold data of any type while Dataframe is 2-Dimensional data structure that hold data like a 2-d array or a table

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
serie=pd.Series([1,3,4,5,6],name="seiries")
print(type(serie))
serie

In [ ]:
import pandas as pd

df = pd.DataFrame({
    "student_id": [1, 2, 3],
    "student_name": ["Ali", "Salim", "Mahaba"]
})

print(type(df))
print(df)

### Column Selection,Addition and Deletion

In [ ]:
new_df=pd.DataFrame({
    "student_id": range(1, 16),
    "name": ["Ali", "Salim", "Mahaba", "Sara", "John", "NaN", "Ella", "Mike", "Nina", "Tom", "Lucas", "NaN", "Zara", "Omar", "Leo"],
    "age": [20, 21, np.nan, 22, 23, np.nan, 24, 25, 26, 22, 21, 20, np.nan, 27, 24],
    "grade": ["A", "B", np.nan, "A", "C", "A", "B", "C", "A", "B", "C", "A", "B", "C", "A"],
    "enrollment_date": pd.date_range(start='2023-01-01', periods=15).tolist()
})
new_df

In [ ]:
# Selecting a column and row
col1=new_df["name"] # Select 2nd column
print(col1)
row2=new_df.iloc[5:10] #selects 4th row
print(row2)

In [ ]:
# Addition
#adding columns
# Adding a new column 'gender'
new_df['gender'] = ['M', 'M', 'F', 'F', 'M', 'F', 'F', 'M', 'F', 'M', 'M', 'F', 'F', 'M', 'M']

print(new_df)
# Adding a new row
# Adding a new row using pd.concat
new_row_df = pd.DataFrame([{'student_id': 16, 'name': 'Emma', 'age': 23, 'grade': 'A', 'enrollment_date': '2023-09-01', 'gender': 'F'}])
new_df = pd.concat([new_df, new_row_df], ignore_index=True)

print(df)

print(new_df)

In [ ]:
print(new_df.iloc[:,1])# Accessing name column using its index
print(new_df.loc[0:15,["name"]])

In [ ]:
print(new_df.iloc[2:6,])#select all column from row 2 to 5

### Handling Missing Data

In [ ]:
new_df.isna() #Returns boolean value for evry attribute with true for missing

In [ ]:
new_df.notnull() #Returns boolean value for evry attribute with false for missing

In [ ]:
new_df.isnull().sum()

In [ ]:
new_df.info # info Also shows where the data is missing. Suitable for small sets

In [ ]:
has_missing = new_df.isnull().any() # Use any to check if column has any missing value
print(has_missing)

In [ ]:
non_missing=new_df.dropna(axis=0,how='any')
non_missing

In [ ]:
filled=new_df.fillna(67)

In [ ]:
data = {
    'A': [1, 2, np.nan, 4],
    'B': [np.nan, 5, np.nan, 6],
    'C': [7, 8, 9, np.nan]
}

df = pd.DataFrame(data)

print("Original DataFrame:\n", df)

# 1. Fill NaNs with a specific value
df_filled_value = df.fillna(0)
print("\nFilled NaNs with 0:\n", df_filled_value)

# 2. Forward fill NaNs
df_filled_ffill = df.fillna(method='ffill')
print("\nForward filled NaNs:\n", df_filled_ffill)

# 3. Backward fill NaNs
df_filled_bfill = df.fillna(method='bfill')
print("\nBackward filled NaNs:\n", df_filled_bfill)

# 4. Fill along columns
df_filled_axis = df.fillna(value=10, axis=1)  # Fill NaNs in all columns with 10
print("\nFilled NaNs along columns with 10:\n", df_filled_axis)

# 5. Limit the number of NaNs to fill
df_filled_limit = df.fillna(method='ffill', limit=1)  # Fill only the first NaN in consecutive NaNs
print("\nForward fill with limit of 1:\n", df_filled_limit)

# 6. Fill in place
df.fillna(0, inplace=True)
print("\nOriginal DataFrame after filling NaNs in place with 0:\n", df)

### Duplicates

In [17]:
new_df.duplicated()# Returns boolean value for each row

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
dtype: bool

In [18]:
new_df.duplicated().sum()# Returns Number of rows with duplicates

0

In [20]:
new_df.index.is_unique # returns boolean value checking whether if rows are unique

True

In [21]:
# Removing duplicates
new_df.drop_duplicates(keep='first')

    student_id    name   age grade      enrollment_date gender
0            1     Ali  20.0     A  2023-01-01 00:00:00      M
1            2   Salim  21.0     B  2023-01-02 00:00:00      M
2            3  Mahaba   NaN   NaN  2023-01-03 00:00:00      F
3            4    Sara  22.0     A  2023-01-04 00:00:00      F
4            5    John  23.0     C  2023-01-05 00:00:00      M
5            6     NaN   NaN     A  2023-01-06 00:00:00      F
6            7    Ella  24.0     B  2023-01-07 00:00:00      F
7            8    Mike  25.0     C  2023-01-08 00:00:00      M
8            9    Nina  26.0     A  2023-01-09 00:00:00      F
9           10     Tom  22.0     B  2023-01-10 00:00:00      M
10          11   Lucas  21.0     C  2023-01-11 00:00:00      M
11          12     NaN  20.0     A  2023-01-12 00:00:00      F
12          13    Zara   NaN     B  2023-01-13 00:00:00      F
13          14    Omar  27.0     C  2023-01-14 00:00:00      M
14          15     Leo  24.0     A  2023-01-15 00:00:00      M
15          16    Emma  23.0     A           2023-09-01      F